Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_fdcan.h
#define    CANFD_CFDC0FDSTS_TDCVF_Pos                             (15U)
#define    CANFD_CFDC0FDSTS_TDCVF_Msk                             (0x1U << CANFD_CFDC0FDSTS_TDCVF_Pos)
#define    CANFD_CFDC0FDSTS_TDCVF                                 CANFD_CFDC0FDSTS_TDCVF_Msk

#define    CANFD_CFDC0FDSTS_PNSTS_Pos                             (12U)
#define    CANFD_CFDC0FDSTS_PNSTS_Msk                             (0x3U << CANFD_CFDC0FDSTS_PNSTS_Pos)
#define    CANFD_CFDC0FDSTS_PNSTS                                 CANFD_CFDC0FDSTS_PNSTS_Msk

#define    CANFD_CFDC0FDSTS_SOCO_Pos                              (9U)
#define    CANFD_CFDC0FDSTS_SOCO_Msk                              (0x1U << CANFD_CFDC0FDSTS_SOCO_Pos)
#define    CANFD_CFDC0FDSTS_SOCO                                  CANFD_CFDC0FDSTS_SOCO_Msk

#define    CANFD_CFDC0FDSTS_EOCO_Pos                              (8U)
#define    CANFD_CFDC0FDSTS_EOCO_Msk                              (0x1U << CANFD_CFDC0FDSTS_EOCO_Pos)
#define    CANFD_CFDC0FDSTS_EOCO                                  CANFD_CFDC0FDSTS_EOCO_Msk

#define    CANFD_CFDC0FDSTS_TDCR_Pos                              (0U)
#define    CANFD_CFDC0FDSTS_TDCR_Msk                              (0xffU << CANFD_CFDC0FDSTS_TDCR_Pos)
#define    CANFD_CFDC0FDSTS_TDCR                                  CANFD_CFDC0FDSTS_TDCR_Msk

#define    CANFD_CFDC0FDCRC_SCNT_Pos                              (24U)
#define    CANFD_CFDC0FDCRC_SCNT_Msk                              (0xfU << CANFD_CFDC0FDCRC_SCNT_Pos)
#define    CANFD_CFDC0FDCRC_SCNT                                  CANFD_CFDC0FDCRC_SCNT_Msk

#define    CANFD_CFDC0FDCRC_CRCREG_Pos                            (0U)
#define    CANFD_CFDC0FDCRC_CRCREG_Msk                            (0x1fffffU << CANFD_CFDC0FDCRC_CRCREG_Pos)
#define    CANFD_CFDC0FDCRC_CRCREG                                CANFD_CFDC0FDCRC_CRCREG_Msk

#define    CANFD_CFDGIPV_PSI_Pos                                  (16U)
#define    CANFD_CFDGIPV_PSI_Msk                                  (0xffffU << CANFD_CFDGIPV_PSI_Pos)
#define    CANFD_CFDGIPV_PSI                                      CANFD_CFDGIPV_PSI_Msk

#define    CANFD_CFDGIPV_CPUBUS_Pos                               (15U)
#define    CANFD_CFDGIPV_CPUBUS_Msk                               (0x1U << CANFD_CFDGIPV_CPUBUS_Pos)
#define    CANFD_CFDGIPV_CPUBUS                                   CANFD_CFDGIPV_CPUBUS_Msk

#define    CANFD_CFDGIPV_IPT_Pos                                  (8U)
#define    CANFD_CFDGIPV_IPT_Msk                                  (0x3U << CANFD_CFDGIPV_IPT_Pos)
#define    CANFD_CFDGIPV_IPT                                      CANFD_CFDGIPV_IPT_Msk

#define    CANFD_CFDGIPV_IPV_Pos                                  (0U)
#define    CANFD_CFDGIPV_IPV_Msk                                  (0xffU << CANFD_CFDGIPV_IPV_Pos)
#define    CANFD_CFDGIPV_IPV                                      CANFD_CFDGIPV_IPV_Msk

#define    CANFD_CFDGCFG_ITRCP_Pos                                (16U)
#define    CANFD_CFDGCFG_ITRCP_Msk                                (0xffffU << CANFD_CFDGCFG_ITRCP_Pos)
#define    CANFD_CFDGCFG_ITRCP                                    CANFD_CFDGCFG_ITRCP_Msk

#define    CANFD_CFDGCFG_TSSS_Pos                                 (12U)
#define    CANFD_CFDGCFG_TSSS_Msk                                 (0x1U << CANFD_CFDGCFG_TSSS_Pos)
#define    CANFD_CFDGCFG_TSSS                                     CANFD_CFDGCFG_TSSS_Msk

#define    CANFD_CFDGCFG_TSP_Pos                                  (8U)
#define    CANFD_CFDGCFG_TSP_Msk                                  (0xfU << CANFD_CFDGCFG_TSP_Pos)
#define    CANFD_CFDGCFG_TSP                                      CANFD_CFDGCFG_TSP_Msk

#define    CANFD_CFDGCFG_CMPOC_Pos                                (5U)
#define    CANFD_CFDGCFG_CMPOC_Msk                                (0x1U << CANFD_CFDGCFG_CMPOC_Pos)
#define    CANFD_CFDGCFG_CMPOC                                    CANFD_CFDGCFG_CMPOC_Msk

#define    CANFD_CFDGCFG_DCS_Pos                                  (4U)
#define    CANFD_CFDGCFG_DCS_Msk                                  (0x1U << CANFD_CFDGCFG_DCS_Pos)
#define    CANFD_CFDGCFG_DCS                                      CANFD_CFDGCFG_DCS_Msk

#define    CANFD_CFDGCFG_MME_Pos                                  (3U)
#define    CANFD_CFDGCFG_MME_Msk                                  (0x1U << CANFD_CFDGCFG_MME_Pos)
#define    CANFD_CFDGCFG_MME                                      CANFD_CFDGCFG_MME_Msk

#define    CANFD_CFDGCFG_DRE_Pos                                  (2U)
#define    CANFD_CFDGCFG_DRE_Msk                                  (0x1U << CANFD_CFDGCFG_DRE_Pos)
#define    CANFD_CFDGCFG_DRE                                      CANFD_CFDGCFG_DRE_Msk

#define    CANFD_CFDGCFG_DCE_Pos                                  (1U)
#define    CANFD_CFDGCFG_DCE_Msk                                  (0x1U << CANFD_CFDGCFG_DCE_Pos)
#define    CANFD_CFDGCFG_DCE                                      CANFD_CFDGCFG_DCE_Msk

#define    CANFD_CFDGCFG_TPRI_Pos                                 (0U)
#define    CANFD_CFDGCFG_TPRI_Msk                                 (0x1U << CANFD_CFDGCFG_TPRI_Pos)
#define    CANFD_CFDGCFG_TPRI                                     CANFD_CFDGCFG_TPRI_Msk

#define    CANFD_CFDGCTR_TSRST_Pos                                (16U)
#define    CANFD_CFDGCTR_TSRST_Msk                                (0x1U << CANFD_CFDGCTR_TSRST_Pos)
#define    CANFD_CFDGCTR_TSRST                                    CANFD_CFDGCTR_TSRST_Msk

#define    CANFD_CFDGCTR_CMPOFIE_Pos                              (11U)
#define    CANFD_CFDGCTR_CMPOFIE_Msk                              (0x1U << CANFD_CFDGCTR_CMPOFIE_Pos)
#define    CANFD_CFDGCTR_CMPOFIE                                  CANFD_CFDGCTR_CMPOFIE_Msk

#define    CANFD_CFDGCTR_THLEIE_Pos                               (10U)
#define    CANFD_CFDGCTR_THLEIE_Msk                               (0x1U << CANFD_CFDGCTR_THLEIE_Pos)
#define    CANFD_CFDGCTR_THLEIE                                   CANFD_CFDGCTR_THLEIE_Msk

#define    CANFD_CFDGCTR_MEIE_Pos                                 (9U)
#define    CANFD_CFDGCTR_MEIE_Msk                                 (0x1U << CANFD_CFDGCTR_MEIE_Pos)
#define    CANFD_CFDGCTR_MEIE                                     CANFD_CFDGCTR_MEIE_Msk

#define    CANFD_CFDGCTR_DEIE_Pos                                 (8U)
#define    CANFD_CFDGCTR_DEIE_Msk                                 (0x1U << CANFD_CFDGCTR_DEIE_Pos)
#define    CANFD_CFDGCTR_DEIE                                     CANFD_CFDGCTR_DEIE_Msk

#define    CANFD_CFDGCTR_GSLPR_Pos                                (2U)
#define    CANFD_CFDGCTR_GSLPR_Msk                                (0x1U << CANFD_CFDGCTR_GSLPR_Pos)
#define    CANFD_CFDGCTR_GSLPR                                    CANFD_CFDGCTR_GSLPR_Msk

#define    CANFD_CFDGCTR_GMDC_Pos                                 (0U)
#define    CANFD_CFDGCTR_GMDC_Msk                                 (0x3U << CANFD_CFDGCTR_GMDC_Pos)
#define    CANFD_CFDGCTR_GMDC                                     CANFD_CFDGCTR_GMDC_Msk

#define    CANFD_CFDGSTS_GRAMINIT_Pos                             (3U)
#define    CANFD_CFDGSTS_GRAMINIT_Msk                             (0x1U << CANFD_CFDGSTS_GRAMINIT_Pos)
#define    CANFD_CFDGSTS_GRAMINIT                                 CANFD_CFDGSTS_GRAMINIT_Msk

