Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_fdcan.h
#define    CANFD_CFDGSTS_GSLPSTS_Pos                              (2U)
#define    CANFD_CFDGSTS_GSLPSTS_Msk                              (0x1U << CANFD_CFDGSTS_GSLPSTS_Pos)
#define    CANFD_CFDGSTS_GSLPSTS                                  CANFD_CFDGSTS_GSLPSTS_Msk

#define    CANFD_CFDGSTS_GHLTSTS_Pos                              (1U)
#define    CANFD_CFDGSTS_GHLTSTS_Msk                              (0x1U << CANFD_CFDGSTS_GHLTSTS_Pos)
#define    CANFD_CFDGSTS_GHLTSTS                                  CANFD_CFDGSTS_GHLTSTS_Msk

#define    CANFD_CFDGSTS_GRSTSTS_Pos                              (0U)
#define    CANFD_CFDGSTS_GRSTSTS_Msk                              (0x1U << CANFD_CFDGSTS_GRSTSTS_Pos)
#define    CANFD_CFDGSTS_GRSTSTS                                  CANFD_CFDGSTS_GRSTSTS_Msk

#define    CANFD_CFDGERFL_EEF_Pos                                 (16U)
#define    CANFD_CFDGERFL_EEF_Msk                                 (0x1U << CANFD_CFDGERFL_EEF_Pos)
#define    CANFD_CFDGERFL_EEF                                     CANFD_CFDGERFL_EEF_Msk

#define    CANFD_CFDGERFL_CMPOF_Pos                               (3U)
#define    CANFD_CFDGERFL_CMPOF_Msk                               (0x1U << CANFD_CFDGERFL_CMPOF_Pos)
#define    CANFD_CFDGERFL_CMPOF                                   CANFD_CFDGERFL_CMPOF_Msk

#define    CANFD_CFDGERFL_THLES_Pos                               (2U)
#define    CANFD_CFDGERFL_THLES_Msk                               (0x1U << CANFD_CFDGERFL_THLES_Pos)
#define    CANFD_CFDGERFL_THLES                                   CANFD_CFDGERFL_THLES_Msk

#define    CANFD_CFDGERFL_MES_Pos                                 (1U)
#define    CANFD_CFDGERFL_MES_Msk                                 (0x1U << CANFD_CFDGERFL_MES_Pos)
#define    CANFD_CFDGERFL_MES                                     CANFD_CFDGERFL_MES_Msk

#define    CANFD_CFDGERFL_DEF_Pos                                 (0U)
#define    CANFD_CFDGERFL_DEF_Msk                                 (0x1U << CANFD_CFDGERFL_DEF_Pos)
#define    CANFD_CFDGERFL_DEF                                     CANFD_CFDGERFL_DEF_Msk

#define    CANFD_CFDGTINTSTS_THIF_Pos                             (4U)
#define    CANFD_CFDGTINTSTS_THIF_Msk                             (0x1U << CANFD_CFDGTINTSTS_THIF_Pos)
#define    CANFD_CFDGTINTSTS_THIF                                 CANFD_CFDGTINTSTS_THIF_Msk

#define    CANFD_CFDGTINTSTS_CFTIF_Pos                            (3U)
#define    CANFD_CFDGTINTSTS_CFTIF_Msk                            (0x1U << CANFD_CFDGTINTSTS_CFTIF_Pos)
#define    CANFD_CFDGTINTSTS_CFTIF                                CANFD_CFDGTINTSTS_CFTIF_Msk

#define    CANFD_CFDGTINTSTS_TQIF_Pos                             (2U)
#define    CANFD_CFDGTINTSTS_TQIF_Msk                             (0x1U << CANFD_CFDGTINTSTS_TQIF_Pos)
#define    CANFD_CFDGTINTSTS_TQIF                                 CANFD_CFDGTINTSTS_TQIF_Msk

#define    CANFD_CFDGTINTSTS_TAIF_Pos                             (1U)
#define    CANFD_CFDGTINTSTS_TAIF_Msk                             (0x1U << CANFD_CFDGTINTSTS_TAIF_Pos)
#define    CANFD_CFDGTINTSTS_TAIF                                 CANFD_CFDGTINTSTS_TAIF_Msk

#define    CANFD_CFDGTINTSTS_TSIF_Pos                             (0U)
#define    CANFD_CFDGTINTSTS_TSIF_Msk                             (0x1U << CANFD_CFDGTINTSTS_TSIF_Pos)
#define    CANFD_CFDGTINTSTS_TSIF                                 CANFD_CFDGTINTSTS_TSIF_Msk

#define    CANFD_CFDGTSC_TS_Pos                                   (0U)
#define    CANFD_CFDGTSC_TS_Msk                                   (0xffffU << CANFD_CFDGTSC_TS_Pos)
#define    CANFD_CFDGTSC_TS                                       CANFD_CFDGTSC_TS_Msk

#define    CANFD_CFDGAFLECTR_AFLDAE_Pos                           (8U)
#define    CANFD_CFDGAFLECTR_AFLDAE_Msk                           (0x1U << CANFD_CFDGAFLECTR_AFLDAE_Pos)
#define    CANFD_CFDGAFLECTR_AFLDAE                               CANFD_CFDGAFLECTR_AFLDAE_Msk

#define    CANFD_CFDGAFLECTR_AFLPN_Pos                            (0U)
#define    CANFD_CFDGAFLECTR_AFLPN_Msk                            (0x1U << CANFD_CFDGAFLECTR_AFLPN_Pos)
#define    CANFD_CFDGAFLECTR_AFLPN                                CANFD_CFDGAFLECTR_AFLPN_Msk

#define    CANFD_CFDGAFLCFG_RNC_Pos                               (16U)
#define    CANFD_CFDGAFLCFG_RNC_Msk                               (0x3fU << CANFD_CFDGAFLCFG_RNC_Pos)
#define    CANFD_CFDGAFLCFG_RNC                                   CANFD_CFDGAFLCFG_RNC_Msk

#define    CANFD_CFDGAFLIDr_GAFLIDE_Pos                           (31U)
#define    CANFD_CFDGAFLIDr_GAFLIDE_Msk                           (0x1U << CANFD_CFDGAFLIDr_GAFLIDE_Pos)
#define    CANFD_CFDGAFLIDr_GAFLIDE                               CANFD_CFDGAFLIDr_GAFLIDE_Msk

#define    CANFD_CFDGAFLIDr_GAFLRTR_Pos                           (30U)
#define    CANFD_CFDGAFLIDr_GAFLRTR_Msk                           (0x1U << CANFD_CFDGAFLIDr_GAFLRTR_Pos)
#define    CANFD_CFDGAFLIDr_GAFLRTR                               CANFD_CFDGAFLIDr_GAFLRTR_Msk

#define    CANFD_CFDGAFLIDr_GAFLLB_Pos                            (29U)
#define    CANFD_CFDGAFLIDr_GAFLLB_Msk                            (0x1U << CANFD_CFDGAFLIDr_GAFLLB_Pos)
#define    CANFD_CFDGAFLIDr_GAFLLB                                CANFD_CFDGAFLIDr_GAFLLB_Msk

#define    CANFD_CFDGAFLIDr_GAFLID_Pos                            (0U)
#define    CANFD_CFDGAFLIDr_GAFLID_Msk                            (0x1fffffffU << CANFD_CFDGAFLIDr_GAFLID_Pos)
#define    CANFD_CFDGAFLIDr_GAFLID                                CANFD_CFDGAFLIDr_GAFLID_Msk

#define    CANFD_CFDGAFLMr_GAFLIDEM_Pos                           (31U)
#define    CANFD_CFDGAFLMr_GAFLIDEM_Msk                           (0x1U << CANFD_CFDGAFLMr_GAFLIDEM_Pos)
#define    CANFD_CFDGAFLMr_GAFLIDEM                               CANFD_CFDGAFLMr_GAFLIDEM_Msk

#define    CANFD_CFDGAFLMr_GAFLRTRM_Pos                           (30U)
#define    CANFD_CFDGAFLMr_GAFLRTRM_Msk                           (0x1U << CANFD_CFDGAFLMr_GAFLRTRM_Pos)
#define    CANFD_CFDGAFLMr_GAFLRTRM                               CANFD_CFDGAFLMr_GAFLRTRM_Msk

#define    CANFD_CFDGAFLMr_GAFLIFL1_Pos                           (29U)
#define    CANFD_CFDGAFLMr_GAFLIFL1_Msk                           (0x1U << CANFD_CFDGAFLMr_GAFLIFL1_Pos)
#define    CANFD_CFDGAFLMr_GAFLIFL1                               CANFD_CFDGAFLMr_GAFLIFL1_Msk

#define    CANFD_CFDGAFLMr_GAFLIDM_Pos                            (0U)
#define    CANFD_CFDGAFLMr_GAFLIDM_Msk                            (0x1fffffffU << CANFD_CFDGAFLMr_GAFLIDM_Pos)
#define    CANFD_CFDGAFLMr_GAFLIDM                                CANFD_CFDGAFLMr_GAFLIDM_Msk

