Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_fdcan.h
#define    CANFD_CFDCFCC_CFTML_Pos                                (16U)
#define    CANFD_CFDCFCC_CFTML_Msk                                (0x3U << CANFD_CFDCFCC_CFTML_Pos)
#define    CANFD_CFDCFCC_CFTML                                    CANFD_CFDCFCC_CFTML_Msk

#define    CANFD_CFDCFCC_CFIGCV_Pos                               (13U)
#define    CANFD_CFDCFCC_CFIGCV_Msk                               (0x7U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    CANFD_CFDCFCC_CFIGCV                                   CANFD_CFDCFCC_CFIGCV_Msk

#define    CANFD_CFDCFCC_CFIM_Pos                                 (12U)
#define    CANFD_CFDCFCC_CFIM_Msk                                 (0x1U << CANFD_CFDCFCC_CFIM_Pos)
#define    CANFD_CFDCFCC_CFIM                                     CANFD_CFDCFCC_CFIM_Msk

#define    CANFD_CFDCFCC_CFITR_Pos                                (11U)
#define    CANFD_CFDCFCC_CFITR_Msk                                (0x1U << CANFD_CFDCFCC_CFITR_Pos)
#define    CANFD_CFDCFCC_CFITR                                    CANFD_CFDCFCC_CFITR_Msk

#define    CANFD_CFDCFCC_CFITSS_Pos                               (10U)
#define    CANFD_CFDCFCC_CFITSS_Msk                               (0x1U << CANFD_CFDCFCC_CFITSS_Pos)
#define    CANFD_CFDCFCC_CFITSS                                   CANFD_CFDCFCC_CFITSS_Msk

#define    CANFD_CFDCFCC_CFM_Pos                                  (8U)
#define    CANFD_CFDCFCC_CFM_Msk                                  (0x1U << CANFD_CFDCFCC_CFM_Pos)
#define    CANFD_CFDCFCC_CFM                                      CANFD_CFDCFCC_CFM_Msk

#define    CANFD_CFDCFCC_CFPLS_Pos                                (4U)
#define    CANFD_CFDCFCC_CFPLS_Msk                                (0x7U << CANFD_CFDCFCC_CFPLS_Pos)
#define    CANFD_CFDCFCC_CFPLS                                    CANFD_CFDCFCC_CFPLS_Msk

#define    CANFD_CFDCFCC_CFTXIE_Pos                               (2U)
#define    CANFD_CFDCFCC_CFTXIE_Msk                               (0x1U << CANFD_CFDCFCC_CFTXIE_Pos)
#define    CANFD_CFDCFCC_CFTXIE                                   CANFD_CFDCFCC_CFTXIE_Msk

#define    CANFD_CFDCFCC_CFRXIE_Pos                               (1U)
#define    CANFD_CFDCFCC_CFRXIE_Msk                               (0x1U << CANFD_CFDCFCC_CFRXIE_Pos)
#define    CANFD_CFDCFCC_CFRXIE                                   CANFD_CFDCFCC_CFRXIE_Msk

#define    CANFD_CFDCFCC_CFE_Pos                                  (0U)
#define    CANFD_CFDCFCC_CFE_Msk                                  (0x1U << CANFD_CFDCFCC_CFE_Pos)
#define    CANFD_CFDCFCC_CFE                                      CANFD_CFDCFCC_CFE_Msk

#define    CANFD_CFDCFSTS_CFMC_Pos                                (8U)
#define    CANFD_CFDCFSTS_CFMC_Msk                                (0x3fU << CANFD_CFDCFSTS_CFMC_Pos)
#define    CANFD_CFDCFSTS_CFMC                                    CANFD_CFDCFSTS_CFMC_Msk

#define    CANFD_CFDCFSTS_CFTXIF_Pos                              (4U)
#define    CANFD_CFDCFSTS_CFTXIF_Msk                              (0x1U << CANFD_CFDCFSTS_CFTXIF_Pos)
#define    CANFD_CFDCFSTS_CFTXIF                                  CANFD_CFDCFSTS_CFTXIF_Msk

#define    CANFD_CFDCFSTS_CFRXIF_Pos                              (3U)
#define    CANFD_CFDCFSTS_CFRXIF_Msk                              (0x1U << CANFD_CFDCFSTS_CFRXIF_Pos)
#define    CANFD_CFDCFSTS_CFRXIF                                  CANFD_CFDCFSTS_CFRXIF_Msk

#define    CANFD_CFDCFSTS_CFMLT_Pos                               (2U)
#define    CANFD_CFDCFSTS_CFMLT_Msk                               (0x1U << CANFD_CFDCFSTS_CFMLT_Pos)
#define    CANFD_CFDCFSTS_CFMLT                                   CANFD_CFDCFSTS_CFMLT_Msk

#define    CANFD_CFDCFSTS_CFFLL_Pos                               (1U)
#define    CANFD_CFDCFSTS_CFFLL_Msk                               (0x1U << CANFD_CFDCFSTS_CFFLL_Pos)
#define    CANFD_CFDCFSTS_CFFLL                                   CANFD_CFDCFSTS_CFFLL_Msk

#define    CANFD_CFDCFSTS_CFEMP_Pos                               (0U)
#define    CANFD_CFDCFSTS_CFEMP_Msk                               (0x1U << CANFD_CFDCFSTS_CFEMP_Pos)
#define    CANFD_CFDCFSTS_CFEMP                                   CANFD_CFDCFSTS_CFEMP_Msk

#define    CANFD_CFDCFPCTR_CFPC_Pos                               (0U)
#define    CANFD_CFDCFPCTR_CFPC_Msk                               (0xffU << CANFD_CFDCFPCTR_CFPC_Pos)
#define    CANFD_CFDCFPCTR_CFPC                                   CANFD_CFDCFPCTR_CFPC_Msk

#define    CANFD_CFDFESTS_CFEMP_Pos                               (8U)
#define    CANFD_CFDFESTS_CFEMP_Msk                               (0x1U << CANFD_CFDFESTS_CFEMP_Pos)
#define    CANFD_CFDFESTS_CFEMP                                   CANFD_CFDFESTS_CFEMP_Msk

#define    CANFD_CFDFESTS_RFxEMP_Pos                              (0U)
#define    CANFD_CFDFESTS_RFxEMP_Msk                              (0x1U << CANFD_CFDFESTS_RFxEMP_Pos)
#define    CANFD_CFDFESTS_RFxEMP                                  CANFD_CFDFESTS_RFxEMP_Msk

#define    CANFD_CFDFFSTS_CFFLL_Pos                               (8U)
#define    CANFD_CFDFFSTS_CFFLL_Msk                               (0x1U << CANFD_CFDFFSTS_CFFLL_Pos)
#define    CANFD_CFDFFSTS_CFFLL                                   CANFD_CFDFFSTS_CFFLL_Msk

#define    CANFD_CFDFFSTS_RFxFLL_Pos                              (0U)
#define    CANFD_CFDFFSTS_RFxFLL_Msk                              (0x1U << CANFD_CFDFFSTS_RFxFLL_Pos)
#define    CANFD_CFDFFSTS_RFxFLL                                  CANFD_CFDFFSTS_RFxFLL_Msk

#define    CANFD_CFDFMSTS_CFMLT_Pos                               (8U)
#define    CANFD_CFDFMSTS_CFMLT_Msk                               (0x1U << CANFD_CFDFMSTS_CFMLT_Pos)
#define    CANFD_CFDFMSTS_CFMLT                                   CANFD_CFDFMSTS_CFMLT_Msk

#define    CANFD_CFDFMSTS_RFxMLT_Pos                              (0U)
#define    CANFD_CFDFMSTS_RFxMLT_Msk                              (0x1U << CANFD_CFDFMSTS_RFxMLT_Pos)
#define    CANFD_CFDFMSTS_RFxMLT                                  CANFD_CFDFMSTS_RFxMLT_Msk

#define    CANFD_CFDRFISTS_RFxIF_Pos                              (0U)
#define    CANFD_CFDRFISTS_RFxIF_Msk                              (0x1U << CANFD_CFDRFISTS_RFxIF_Pos)
#define    CANFD_CFDRFISTS_RFxIF                                  CANFD_CFDRFISTS_RFxIF_Msk

#define    CANFD_CFDTMCi_TMOM_Pos                                 (2U)
#define    CANFD_CFDTMCi_TMOM_Msk                                 (0x1U << CANFD_CFDTMCi_TMOM_Pos)
#define    CANFD_CFDTMCi_TMOM                                     CANFD_CFDTMCi_TMOM_Msk

#define    CANFD_CFDTMCi_TMTAR_Pos                                (1U)
#define    CANFD_CFDTMCi_TMTAR_Msk                                (0x1U << CANFD_CFDTMCi_TMTAR_Pos)
#define    CANFD_CFDTMCi_TMTAR                                    CANFD_CFDTMCi_TMTAR_Msk

#define    CANFD_CFDTMCi_TMTR_Pos                                 (0U)
#define    CANFD_CFDTMCi_TMTR_Msk                                 (0x1U << CANFD_CFDTMCi_TMTR_Pos)
#define    CANFD_CFDTMCi_TMTR                                     CANFD_CFDTMCi_TMTR_Msk

#define    CANFD_CFDTMSTSj_TMTARM_Pos                             (4U)
#define    CANFD_CFDTMSTSj_TMTARM_Msk                             (0x1U << CANFD_CFDTMSTSj_TMTARM_Pos)
#define    CANFD_CFDTMSTSj_TMTARM                                 CANFD_CFDTMSTSj_TMTARM_Msk

