Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_fdcan.h
#define    CANFD_CFDGPFLPTs_GPFLRANG0_Pos                         (30U)
#define    CANFD_CFDGPFLPTs_GPFLRANG0_Msk                         (0x1U << CANFD_CFDGPFLPTs_GPFLRANG0_Pos)
#define    CANFD_CFDGPFLPTs_GPFLRANG0                             CANFD_CFDGPFLPTs_GPFLRANG0_Msk

#define    CANFD_CFDGPFLPTs_GPFLOUT0_Pos                          (29U)
#define    CANFD_CFDGPFLPTs_GPFLOUT0_Msk                          (0x1U << CANFD_CFDGPFLPTs_GPFLOUT0_Pos)
#define    CANFD_CFDGPFLPTs_GPFLOUT0                              CANFD_CFDGPFLPTs_GPFLOUT0_Msk

#define    CANFD_CFDGPFLPTs_GPFLOFFSET0_Pos                       (16U)
#define    CANFD_CFDGPFLPTs_GPFLOFFSET0_Msk                       (0xfU << CANFD_CFDGPFLPTs_GPFLOFFSET0_Pos)
#define    CANFD_CFDGPFLPTs_GPFLOFFSET0                           CANFD_CFDGPFLPTs_GPFLOFFSET0_Msk

#define    CANFD_CFDGPFLPTs_GPFLRANG1_Pos                         (14U)
#define    CANFD_CFDGPFLPTs_GPFLRANG1_Msk                         (0x1U << CANFD_CFDGPFLPTs_GPFLRANG1_Pos)
#define    CANFD_CFDGPFLPTs_GPFLRANG1                             CANFD_CFDGPFLPTs_GPFLRANG1_Msk

#define    CANFD_CFDGPFLPTs_GPFLOUT1_Pos                          (13U)
#define    CANFD_CFDGPFLPTs_GPFLOUT1_Msk                          (0x1U << CANFD_CFDGPFLPTs_GPFLOUT1_Pos)
#define    CANFD_CFDGPFLPTs_GPFLOUT1                              CANFD_CFDGPFLPTs_GPFLOUT1_Msk

#define    CANFD_CFDGPFLPTs_GPFLOFFSET1_Pos                       (0U)
#define    CANFD_CFDGPFLPTs_GPFLOFFSET1_Msk                       (0xfU << CANFD_CFDGPFLPTs_GPFLOFFSET1_Pos)
#define    CANFD_CFDGPFLPTs_GPFLOFFSET1                           CANFD_CFDGPFLPTs_GPFLOFFSET1_Msk

#define    CANFD_CFDGPFLPD0s_FDATA_Pos                            (0U)
#define    CANFD_CFDGPFLPD0s_FDATA_Msk                            (0xffffffffU << CANFD_CFDGPFLPD0s_FDATA_Pos)
#define    CANFD_CFDGPFLPD0s_FDATA                                CANFD_CFDGPFLPD0s_FDATA_Msk

#define    CANFD_CFDGPFLPD1s_FDATA_Pos                            (0U)
#define    CANFD_CFDGPFLPD1s_FDATA_Msk                            (0xffffffffU << CANFD_CFDGPFLPD1s_FDATA_Pos)
#define    CANFD_CFDGPFLPD1s_FDATA                                CANFD_CFDGPFLPD1s_FDATA_Msk

#define    CANFD_CFDGPFLPM0s_FMASK_Pos                            (0U)
#define    CANFD_CFDGPFLPM0s_FMASK_Msk                            (0xffffffffU << CANFD_CFDGPFLPM0s_FMASK_Pos)
#define    CANFD_CFDGPFLPM0s_FMASK                                CANFD_CFDGPFLPM0s_FMASK_Msk

#define    CANFD_CFDGPFLPM1s_FMASK_Pos                            (0U)
#define    CANFD_CFDGPFLPM1s_FMASK_Msk                            (0xffffffffU << CANFD_CFDGPFLPM1s_FMASK_Pos)
#define    CANFD_CFDGPFLPM1s_FMASK                                CANFD_CFDGPFLPM1s_FMASK_Msk

#define    CANFD_CFDGAFLIGNENT_IRN_Pos                            (0U)
#define    CANFD_CFDGAFLIGNENT_IRN_Msk                            (0x1fU << CANFD_CFDGAFLIGNENT_IRN_Pos)
#define    CANFD_CFDGAFLIGNENT_IRN                                CANFD_CFDGAFLIGNENT_IRN_Msk

#define    CANFD_CFDGAFLIGNCTR_KEY_Pos                            (8U)
#define    CANFD_CFDGAFLIGNCTR_KEY_Msk                            (0xffU << CANFD_CFDGAFLIGNCTR_KEY_Pos)
#define    CANFD_CFDGAFLIGNCTR_KEY                                CANFD_CFDGAFLIGNCTR_KEY_Msk

#define    CANFD_CFDGAFLIGNCTR_IREN_Pos                           (0U)
#define    CANFD_CFDGAFLIGNCTR_IREN_Msk                           (0x1U << CANFD_CFDGAFLIGNCTR_IREN_Pos)
#define    CANFD_CFDGAFLIGNCTR_IREN                               CANFD_CFDGAFLIGNCTR_IREN_Msk

#define    CANFD_CFDRMIEC_RMIEg_Pos                               (0U)
#define    CANFD_CFDRMIEC_RMIEg_Msk                               (0x1U << CANFD_CFDRMIEC_RMIEg_Pos)
#define    CANFD_CFDRMIEC_RMIEg                                   CANFD_CFDRMIEC_RMIEg_Msk

#define    CANFD_CFDRMID_RMIDE_Pos                                (31U)
#define    CANFD_CFDRMID_RMIDE_Msk                                (0x1U << CANFD_CFDRMID_RMIDE_Pos)
#define    CANFD_CFDRMID_RMIDE                                    CANFD_CFDRMID_RMIDE_Msk

#define    CANFD_CFDRMID_RMRTR_Pos                                (30U)
#define    CANFD_CFDRMID_RMRTR_Msk                                (0x1U << CANFD_CFDRMID_RMRTR_Pos)
#define    CANFD_CFDRMID_RMRTR                                    CANFD_CFDRMID_RMRTR_Msk

#define    CANFD_CFDRMID_RMID_Pos                                 (0U)
#define    CANFD_CFDRMID_RMID_Msk                                 (0x1fffffffU << CANFD_CFDRMID_RMID_Pos)
#define    CANFD_CFDRMID_RMID                                     CANFD_CFDRMID_RMID_Msk

#define    CANFD_CFDRMPTR_RMDLC_Pos                               (28U)
#define    CANFD_CFDRMPTR_RMDLC_Msk                               (0xfU << CANFD_CFDRMPTR_RMDLC_Pos)
#define    CANFD_CFDRMPTR_RMDLC                                   CANFD_CFDRMPTR_RMDLC_Msk

#define    CANFD_CFDRMPTR_RMTS_Pos                                (0U)
#define    CANFD_CFDRMPTR_RMTS_Msk                                (0xffffU << CANFD_CFDRMPTR_RMTS_Pos)
#define    CANFD_CFDRMPTR_RMTS                                    CANFD_CFDRMPTR_RMTS_Msk

#define    CANFD_CFDRMFDSTS_RMPTR_Pos                             (16U)
#define    CANFD_CFDRMFDSTS_RMPTR_Msk                             (0xffffU << CANFD_CFDRMFDSTS_RMPTR_Pos)
#define    CANFD_CFDRMFDSTS_RMPTR                                 CANFD_CFDRMFDSTS_RMPTR_Msk

#define    CANFD_CFDRMFDSTS_RMIFL_Pos                             (8U)
#define    CANFD_CFDRMFDSTS_RMIFL_Msk                             (0x3U << CANFD_CFDRMFDSTS_RMIFL_Pos)
#define    CANFD_CFDRMFDSTS_RMIFL                                 CANFD_CFDRMFDSTS_RMIFL_Msk

#define    CANFD_CFDRMFDSTS_RMFDF_Pos                             (2U)
#define    CANFD_CFDRMFDSTS_RMFDF_Msk                             (0x1U << CANFD_CFDRMFDSTS_RMFDF_Pos)
#define    CANFD_CFDRMFDSTS_RMFDF                                 CANFD_CFDRMFDSTS_RMFDF_Msk

#define    CANFD_CFDRMFDSTS_RMBRS_Pos                             (1U)
#define    CANFD_CFDRMFDSTS_RMBRS_Msk                             (0x1U << CANFD_CFDRMFDSTS_RMBRS_Pos)
#define    CANFD_CFDRMFDSTS_RMBRS                                 CANFD_CFDRMFDSTS_RMBRS_Msk

