Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_fdcan.h
/**
  * @brief    Channel 0 Overload interrupt enable status 
  * @rmtoll   CFDC0CTR    OLIE    FL_CANFD_CH0_IsEnabledIT_Overload
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_Overload(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_OLIE_Msk) == CANFD_CFDC0CTR_OLIE_Msk);
}

/**
  * @brief    Channel 0 Overload interrupt disable 
  * @rmtoll   CFDC0CTR    OLIE    FL_CANFD_CH0_DisableIT_Overload
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_Overload(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_OLIE_Msk);
}

/**
  * @brief    Channel 0 Bus-Off Recovery interrupt enable 
  * @rmtoll   CFDC0CTR    BORIE    FL_CANFD_CH0_EnableIT_BusOffRecovery
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_BusOffRecovery(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BORIE_Msk);
}

/**
  * @brief    Channel 0 Bus-Off Recovery interrupt enable status 
  * @rmtoll   CFDC0CTR    BORIE    FL_CANFD_CH0_IsEnabledIT_BusOffRecovery
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_BusOffRecovery(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BORIE_Msk) == CANFD_CFDC0CTR_BORIE_Msk);
}

/**
  * @brief    Channel 0 Bus-Off Recovery interrupt disable 
  * @rmtoll   CFDC0CTR    BORIE    FL_CANFD_CH0_DisableIT_BusOffRecovery
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_BusOffRecovery(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BORIE_Msk);
}

/**
  * @brief    Channel 0 Bus-Off Entry interrupt enable 
  * @rmtoll   CFDC0CTR    BOEIE    FL_CANFD_CH0_EnableIT_BusOff
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_BusOff(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BOEIE_Msk);
}

/**
  * @brief    Channel 0 Bus-Off Entry interrupt enable status 
  * @rmtoll   CFDC0CTR    BOEIE    FL_CANFD_CH0_IsEnabledIT_BusOff
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_BusOff(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BOEIE_Msk) == CANFD_CFDC0CTR_BOEIE_Msk);
}

/**
  * @brief    Channel 0 Bus-Off Entry interrupt disable 
  * @rmtoll   CFDC0CTR    BOEIE    FL_CANFD_CH0_DisableIT_BusOff
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_BusOff(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BOEIE_Msk);
}

/**
  * @brief    Channel 0 Error Passive interrupt enable 
  * @rmtoll   CFDC0CTR    EPIE    FL_CANFD_CH0_EnableIT_ErrorPassive
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_ErrorPassive(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EPIE_Msk);
}

/**
  * @brief    Channel 0 Error Passive interrupt enable status 
  * @rmtoll   CFDC0CTR    EPIE    FL_CANFD_CH0_IsEnabledIT_ErrorPassive
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_ErrorPassive(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EPIE_Msk) == CANFD_CFDC0CTR_EPIE_Msk);
}

/**
  * @brief    Channel 0 Error Passive interrupt disable 
  * @rmtoll   CFDC0CTR    EPIE    FL_CANFD_CH0_DisableIT_ErrorPassive
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_ErrorPassive(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EPIE_Msk);
}

/**
  * @brief    Channel 0 Error Warning interrupt enable 
  * @rmtoll   CFDC0CTR    EWIE    FL_CANFD_CH0_EnableIT_ErrorWarning
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_ErrorWarning(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EWIE_Msk);
}

/**
  * @brief    Channel 0 Error Warning interrupt enable status 
  * @rmtoll   CFDC0CTR    EWIE    FL_CANFD_CH0_IsEnabledIT_ErrorWarning
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_ErrorWarning(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EWIE_Msk) == CANFD_CFDC0CTR_EWIE_Msk);
}

/**
  * @brief    Channel 0 Error Warning interrupt disable 
  * @rmtoll   CFDC0CTR    EWIE    FL_CANFD_CH0_DisableIT_ErrorWarning
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_ErrorWarning(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EWIE_Msk);
}

/**
  * @brief    Channel 0 Bus Error interrupt enable 
  * @rmtoll   CFDC0CTR    BEIE    FL_CANFD_CH0_EnableIT_BusError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_BusError(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BEIE_Msk);
}

/**
  * @brief    Channel 0 Bus Error interrupt enable status 
  * @rmtoll   CFDC0CTR    BEIE    FL_CANFD_CH0_IsEnabledIT_BusError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_BusError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BEIE_Msk) == CANFD_CFDC0CTR_BEIE_Msk);
}

/**
  * @brief    Channel 0 Bus Error interrupt disable 
  * @rmtoll   CFDC0CTR    BEIE    FL_CANFD_CH0_DisableIT_BusError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_BusError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BEIE_Msk);
}

/**
  * @brief    Channel 0 Software Return from Bus-Off enable 
  * @rmtoll   CFDC0CTR    RTBO    FL_CANFD_CH0_Enable_ReturnFromBusOff
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_Enable_ReturnFromBusOff(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_RTBO_Msk);
}

/**
  * @brief    Channel 0 Software Return from Bus-Off disable 
  * @rmtoll   CFDC0CTR    RTBO    FL_CANFD_CH0_Disable_ReturnFromBusOff
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_Disable_ReturnFromBusOff(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_RTBO_Msk);
}

/**
  * @brief    Channel 0 Software Return from Bus-Off enable status
  * @rmtoll   CFDC0CTR    RTBO    FL_CANFD_CH0_IsEnabled_ReturnFromBusOff
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabled_ReturnFromBusOff(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_RTBO_Msk) == CANFD_CFDC0CTR_RTBO_Msk);
}

/**
  * @brief    Channel 0 Channel Sleep Request enable 
  * @rmtoll   CFDC0CTR    CSLPR    FL_CANFD_CH0_Enable_Sleep
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_Enable_Sleep(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CSLPR_Msk);
}

/**
  * @brief    Channel 0 Channel Sleep Request disable 
  * @rmtoll   CFDC0CTR    CSLPR    FL_CANFD_CH0_Disable_Sleep
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_Disable_Sleep(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CSLPR_Msk);
}

/**
  * @brief    Channel 0 Channel Sleep Request enable status
  * @rmtoll   CFDC0CTR    CSLPR    FL_CANFD_CH0_IsEnabled_Sleep
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabled_Sleep(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CSLPR_Msk) == CANFD_CFDC0CTR_CSLPR_Msk);
}

/**
  * @brief    Set Channel 0 Channel Mode
  * @rmtoll   CFDC0CTR    CHMDC    FL_CANFD_CH0_SetChannelMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_MODE_OPERATION
  *           @arg @ref FL_CANFD_CHANNEL_MODE_RESET
  *           @arg @ref FL_CANFD_CHANNEL_MODE_HALT
  *           @arg @ref FL_CANFD_CHANNEL_MODE_KEEP_CURRENT
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_SetChannelMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CHMDC_Msk, mode);
}

/**
  * @brief    Get Channel 0 Channel Mode
  * @rmtoll   CFDC0CTR    CHMDC    FL_CANFD_CH0_GetChannelMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_MODE_OPERATION
  *           @arg @ref FL_CANFD_CHANNEL_MODE_RESET
  *           @arg @ref FL_CANFD_CHANNEL_MODE_HALT
  *           @arg @ref FL_CANFD_CHANNEL_MODE_KEEP_CURRENT
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_GetChannelMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CHMDC_Msk));
}

/**
  * @brief    Get Channel 0 Transmission Error Count
  * @rmtoll   CFDC0STS    TEC    FL_CANFD_CH0_ReadTxErrorCount
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadTxErrorCount(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, (0xffU << 24U)) >> 24U);
}

/**
  * @brief    Get Channel 0 Reception Error Count 
  * @rmtoll   CFDC0STS    REC    FL_CANFD_CH0_ReadRxErrorCount
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadRxErrorCount(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, (0xffU << 16U)) >> 16U);
}

/**
  * @brief    Get Channel 0 Error State Indication Flag
  * @rmtoll   CFDC0STS    ESIF    FL_CANFD_CH0_IsActiveFlag_ErrorStateIndication
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_ErrorStateIndication(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_ESIF_Msk) == (CANFD_CFDC0STS_ESIF_Msk));
}

/**
  * @brief    Clear Channel 0 Error State Indication Flag
  * @rmtoll   CFDC0STS    ESIF    FL_CANFD_CH0_ClearFlag_ErrorStateIndication
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_ErrorStateIndication(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_ESIF_Msk);
}

/**
  * @brief    Get Channel 0 Channel Communication Status
  * @rmtoll   CFDC0STS    COMSTS    FL_CANFD_CH0_IsActiveFlag_CommStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_CommStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_COMSTS_Msk) == (CANFD_CFDC0STS_COMSTS_Msk));
}

/**
  * @brief    Get Channel 0 Channel Receive Status
  * @rmtoll   CFDC0STS    RECSTS    FL_CANFD_CH0_IsActiveFlag_RxStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_RxStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_RECSTS_Msk) == (CANFD_CFDC0STS_RECSTS_Msk));
}

/**
  * @brief    Get Channel 0 Channel Transmit Status
  * @rmtoll   CFDC0STS    TRMSTS    FL_CANFD_CH0_IsActiveFlag_TxStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_TxStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_TRMSTS_Msk) == (CANFD_CFDC0STS_TRMSTS_Msk));
}

/**
  * @brief    Get Channel 0 Channel Bus-Off Status
  * @rmtoll   CFDC0STS    BOSTS    FL_CANFD_CH0_IsActiveFlag_BusOffStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_BusOffStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_BOSTS_Msk) == (CANFD_CFDC0STS_BOSTS_Msk));
}

/**
  * @brief    Get Channel 0 Channel Error Passive Status
  * @rmtoll   CFDC0STS    EPSTS    FL_CANFD_CH0_IsActiveFlag_ErrorPassiveStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_ErrorPassiveStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_EPSTS_Msk) == (CANFD_CFDC0STS_EPSTS_Msk));
}

/**
  * @brief    Get Channel 0 Channel SLEEP Status
  * @rmtoll   CFDC0STS    CSLPSTS    FL_CANFD_CH0_IsActiveFlag_SleepStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_SleepStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_CSLPSTS_Msk) == (CANFD_CFDC0STS_CSLPSTS_Msk));
}

/**
  * @brief    Get Channel 0 Channel HALT Status
  * @rmtoll   CFDC0STS    CHLTSTS    FL_CANFD_CH0_IsActiveFlag_HaltStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_HaltStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_CHLTSTS_Msk) == (CANFD_CFDC0STS_CHLTSTS_Msk));
}

/**
  * @brief    Get Channel 0 Channel RESET Status
  * @rmtoll   CFDC0STS    CRSTSTS    FL_CANFD_CH0_IsActiveFlag_ResetStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_ResetStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0STS, CANFD_CFDC0STS_CRSTSTS_Msk) == (CANFD_CFDC0STS_CRSTSTS_Msk));
}

/**
  * @brief    Get Channel 0 CRC Register value
  * @rmtoll   CFDC0ERFL    CRCREG    FL_CANFD_CH0_ReadCRCREG
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadCRCREG(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, (0x7fffU << 16U)) >> 16U);
}

/**
  * @brief    Get Channel 0 Acknowledge Delimiter Error
  * @rmtoll   CFDC0ERFL    ADERR    FL_CANFD_CH0_IsActiveFlag_AckDelimiterError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_AckDelimiterError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_ADERR_Msk) == (CANFD_CFDC0ERFL_ADERR_Msk));
}

/**
  * @brief    Clear Channel 0 Acknowledge Delimiter Error
  * @rmtoll   CFDC0ERFL    ADERR    FL_CANFD_CH0_ClearFlag_AckDelimiterError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_AckDelimiterError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_ADERR_Msk);
}

/**
  * @brief    Get Channel 0 Bit 0 Error
  * @rmtoll   CFDC0ERFL    B0ERR    FL_CANFD_CH0_IsActiveFlag_Bit0Error
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_Bit0Error(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_B0ERR_Msk) == (CANFD_CFDC0ERFL_B0ERR_Msk));
}

/**
  * @brief    Clear Channel 0 Bit 0 Error
  * @rmtoll   CFDC0ERFL    B0ERR    FL_CANFD_CH0_ClearFlag_Bit0Error
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_Bit0Error(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_B0ERR_Msk);
}

/**
  * @brief    Get Channel 0 Bit 1 Error
  * @rmtoll   CFDC0ERFL    B1ERR    FL_CANFD_CH0_IsActiveFlag_Bit1Error
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_Bit1Error(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_B1ERR_Msk) == (CANFD_CFDC0ERFL_B1ERR_Msk));
}

/**
  * @brief    Clear Channel 0 Bit 1 Error
  * @rmtoll   CFDC0ERFL    B1ERR    FL_CANFD_CH0_ClearFlag_Bit1Error
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_Bit1Error(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_B1ERR_Msk);
}

/**
  * @brief    Get Channel 0 CRC Error
  * @rmtoll   CFDC0ERFL    CERR    FL_CANFD_CH0_IsActiveFlag_CRCError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_CRCError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_CERR_Msk) == (CANFD_CFDC0ERFL_CERR_Msk));
}

/**
  * @brief    Clear Channel 0 CRC Error
  * @rmtoll   CFDC0ERFL    CERR    FL_CANFD_CH0_ClearFlag_CRCError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_CRCError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_CERR_Msk);
}

/**
  * @brief    Get Channel 0 Acknowledge Error
  * @rmtoll   CFDC0ERFL    AERR    FL_CANFD_CH0_IsActiveFlag_AckError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_AckError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_AERR_Msk) == (CANFD_CFDC0ERFL_AERR_Msk));
}

/**
  * @brief    Clear Channel 0 Acknowledge Error
  * @rmtoll   CFDC0ERFL    AERR    FL_CANFD_CH0_ClearFlag_AckError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_AckError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_AERR_Msk);
}

/**
  * @brief    Get Channel 0 Form Error
  * @rmtoll   CFDC0ERFL    FERR    FL_CANFD_CH0_IsActiveFlag_FormError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_FormError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_FERR_Msk) == (CANFD_CFDC0ERFL_FERR_Msk));
}

/**
  * @brief    Clear Channel 0 Form Error
  * @rmtoll   CFDC0ERFL    FERR    FL_CANFD_CH0_ClearFlag_FormError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_FormError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_FERR_Msk);
}

/**
  * @brief    Get Channel 0 Stuff Error
  * @rmtoll   CFDC0ERFL    SERR    FL_CANFD_CH0_IsActiveFlag_StuffError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_StuffError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_SERR_Msk) == (CANFD_CFDC0ERFL_SERR_Msk));
}

/**
  * @brief    Clear Channel 0 Stuff Error
  * @rmtoll   CFDC0ERFL    SERR    FL_CANFD_CH0_ClearFlag_StuffError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_StuffError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_SERR_Msk);
}

/**
  * @brief    Get Channel 0 Arbitration Lost Flag
  * @rmtoll   CFDC0ERFL    ALF    FL_CANFD_CH0_IsActiveFlag_ArbitrationLost
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_ArbitrationLost(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_ALF_Msk) == (CANFD_CFDC0ERFL_ALF_Msk));
}

/**
  * @brief    Clear Channel 0 Arbitration Lost Flag
  * @rmtoll   CFDC0ERFL    ALF    FL_CANFD_CH0_ClearFlag_ArbitrationLost
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_ArbitrationLost(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_ALF_Msk);
}

/**
  * @brief    Get Channel 0 Bus Lock Flag
  * @rmtoll   CFDC0ERFL    BLF    FL_CANFD_CH0_IsActiveFlag_BusLock
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_BusLock(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_BLF_Msk) == (CANFD_CFDC0ERFL_BLF_Msk));
}

/**
  * @brief    Clear Channel 0 Bus Lock Flag
  * @rmtoll   CFDC0ERFL    BLF    FL_CANFD_CH0_ClearFlag_BusLock
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_BusLock(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_BLF_Msk);
}

/**
  * @brief    Get Channel 0 Overload Flag
  * @rmtoll   CFDC0ERFL    OVLF    FL_CANFD_CH0_IsActiveFlag_OverLoad
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_OverLoad(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_OVLF_Msk) == (CANFD_CFDC0ERFL_OVLF_Msk));
}

/**
  * @brief    Clear Channel 0 Overload Flag
  * @rmtoll   CFDC0ERFL    OVLF    FL_CANFD_CH0_ClearFlag_OverLoad
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_OverLoad(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_OVLF_Msk);
}

/**
  * @brief    Get Channel 0 Bus-Off Recovery Flag
  * @rmtoll   CFDC0ERFL    BORF    FL_CANFD_CH0_IsActiveFlag_BusOffRecovery
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_BusOffRecovery(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_BORF_Msk) == (CANFD_CFDC0ERFL_BORF_Msk));
}

/**
  * @brief    Clear Channel 0 Bus-Off Recovery Flag
  * @rmtoll   CFDC0ERFL    BORF    FL_CANFD_CH0_ClearFlag_BusOffRecovery
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_BusOffRecovery(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_BORF_Msk);
}

/**
  * @brief    Get Channel 0 Bus-Off Entry Flag
  * @rmtoll   CFDC0ERFL    BOEF    FL_CANFD_CH0_IsActiveFlag_BusOff
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsActiveFlag_BusOff(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_BOEF_Msk) == (CANFD_CFDC0ERFL_BOEF_Msk));
}

/**
  * @brief    Clear Channel 0 Bus-Off Entry Flag
  * @rmtoll   CFDC0ERFL    BOEF    FL_CANFD_CH0_ClearFlag_BusOff
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_ClearFlag_BusOff(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0ERFL, CANFD_CFDC0ERFL_BOEF_Msk);
}

